#一共两部电梯，楼层为4层, 求哪个电梯响应最合理
'''
按钮状态共有2*4*4*2=64种 每层是上，下，上下，不亮，顶层和底层只有单方向2种
（1不，1上） *  （2不，2下，2上，2上下），* （3不，3下，3上，3上下）  *  （4下，4不）"
6位2进制	"首位0全部不亮，1 1上亮
23位：00 2不，01 2下，10 2上，11 3上下
45位：00 3不，01 3下，10 3上，11 3上下
6位：0 6不，1 6下"

电梯位置共有：（2+3+3+2）^2 = 100种
每个电梯可能位于1，2，3，4，1到2，2到1，2到3，3到2，3到4，4到3，两个电梯就是10的平方
7位2进制	"用4位表示一个电梯
首位0000 1不，0001 1上
23位 0010 2不，0011 2到1， 0100 2到3，0101不用
45位 0110 3不，0111 3到2， 1000 3到4，1001不用
4位 1111 4不，11104下"
'''

button_status = ["无", '上', '下', '上下']

anniu_dict = {
"000000" : "无按钮 2楼无按钮 3楼无按钮 4楼无按钮" ,
"000001" : "1楼上按钮 2楼无按钮 3楼无按钮 4楼无按钮" ,
"000010" : "1楼无按钮 2楼下按钮 3楼无按钮 4楼无按钮" ,
"000011" : "1楼上按钮 2楼下按钮 3楼无按钮 4楼无按钮" ,
"000100" : "1楼无按钮 2楼上按钮 3楼无按钮 4楼无按钮" ,
"000101" : "1楼上按钮 2楼上按钮 3楼无按钮 4楼无按钮" ,
"000110" : "1楼无按钮 2楼上下按钮 3楼无按钮 4楼无按钮" ,
"000111" : "1楼上按钮 2楼上下按钮 3楼无按钮 4楼无按钮" ,
"001000" : "1楼无按钮 2楼无按钮 3楼下按钮 4楼无按钮" ,
"001001" : "1楼上按钮 2楼无按钮 3楼下按钮 4楼无按钮" ,
"001010" : "1楼无按钮 2楼下按钮 3楼下按钮 4楼无按钮" ,
"001011" : "1楼上按钮 2楼下按钮 3楼下按钮 4楼无按钮" ,
"001100" : "1楼无按钮 2楼上按钮 3楼下按钮 4楼无按钮" ,
"001101" : "1楼上按钮 2楼上按钮 3楼下按钮 4楼无按钮" ,
"001110" : "1楼无按钮 2楼上下按钮 3楼下按钮 4楼无按钮" ,
"001111" : "1楼上按钮 2楼上下按钮 3楼下按钮 4楼无按钮" ,
"010000" : "1楼无按钮 2楼无按钮 3楼上按钮 4楼无按钮" ,
"010001" : "1楼上按钮 2楼无按钮 3楼上按钮 4楼无按钮" ,
"010010" : "1楼无按钮 2楼下按钮 3楼上按钮 4楼无按钮" ,
"010011" : "1楼上按钮 2楼下按钮 3楼上按钮 4楼无按钮" ,
"010100" : "1楼无按钮 2楼上按钮 3楼上按钮 4楼无按钮" ,
"010101" : "1楼上按钮 2楼上按钮 3楼上按钮 4楼无按钮" ,
"010110" : "1楼无按钮 2楼上下按钮 3楼上按钮 4楼无按钮" ,
"010111" : "1楼上按钮 2楼上下按钮 3楼上按钮 4楼无按钮" ,
"011000" : "1楼无按钮 2楼无按钮 3楼上下按钮 4楼无按钮" ,
"011001" : "1楼上按钮 2楼无按钮 3楼上下按钮 4楼无按钮" ,
"011010" : "1楼无按钮 2楼下按钮 3楼上下按钮 4楼无按钮" ,
"011011" : "1楼上按钮 2楼下按钮 3楼上下按钮 4楼无按钮" ,
"011100" : "1楼无按钮 2楼上按钮 3楼上下按钮 4楼无按钮" ,
"011101" : "1楼上按钮 2楼上按钮 3楼上下按钮 4楼无按钮" ,
"011110" : "1楼无按钮 2楼上下按钮 3楼上下按钮 4楼无按钮" ,
"011111" : "1楼上按钮 2楼上下按钮 3楼上下按钮 4楼无按钮" ,
"100000" : "1楼无按钮 2楼无按钮 3楼无按钮 4楼下按钮" ,
"100001" : "1楼上按钮 2楼无按钮 3楼无按钮 4楼下按钮" ,
"100010" : "1楼无按钮 2楼下按钮 3楼无按钮 4楼下按钮" ,
"100011" : "1楼上按钮 2楼下按钮 3楼无按钮 4楼下按钮" ,
"100100" : "1楼无按钮 2楼上按钮 3楼无按钮 4楼下按钮" ,
"100101" : "1楼上按钮 2楼上按钮 3楼无按钮 4楼下按钮" ,
"100110" : "1楼无按钮 2楼上下按钮 3楼无按钮 4楼下按钮" ,
"100111" : "1楼上按钮 2楼上下按钮 3楼无按钮 4楼下按钮" ,
"101000" : "1楼无按钮 2楼无按钮 3楼下按钮 4楼下按钮" ,
"101001" : "1楼上按钮 2楼无按钮 3楼下按钮 4楼下按钮" ,
"101010" : "1楼无按钮 2楼下按钮 3楼下按钮 4楼下按钮" ,
"101011" : "1楼上按钮 2楼下按钮 3楼下按钮 4楼下按钮" ,
"101100" : "1楼无按钮 2楼上按钮 3楼下按钮 4楼下按钮" ,
"101101" : "1楼上按钮 2楼上按钮 3楼下按钮 4楼下按钮" ,
"101110" : "1楼无按钮 2楼上下按钮 3楼下按钮 4楼下按钮" ,
"101111" : "1楼上按钮 2楼上下按钮 3楼下按钮 4楼下按钮" ,
"110000" : "1楼无按钮 2楼无按钮 3楼上按钮 4楼下按钮" ,
"110001" : "1楼上按钮 2楼无按钮 3楼上按钮 4楼下按钮" ,
"110010" : "1楼无按钮 2楼下按钮 3楼上按钮 4楼下按钮" ,
"110011" : "1楼上按钮 2楼下按钮 3楼上按钮 4楼下按钮" ,
"110100" : "1楼无按钮 2楼上按钮 3楼上按钮 4楼下按钮" ,
"110101" : "1楼上按钮 2楼上按钮 3楼上按钮 4楼下按钮" ,
"110110" : "1楼无按钮 2楼上下按钮 3楼上按钮 4楼下按钮" ,
"110111" : "1楼上按钮 2楼上下按钮 3楼上按钮 4楼下按钮" ,
"111000" : "1楼无按钮 2楼无按钮 3楼上下按钮 4楼下按钮" ,
"111001" : "1楼上按钮 2楼无按钮 3楼上下按钮 4楼下按钮" ,
"111010" : "1楼无按钮 2楼下按钮 3楼上下按钮 4楼下按钮" ,
"111011" : "1楼上按钮 2楼下按钮 3楼上下按钮 4楼下按钮" ,
"111100" : "1楼无按钮 2楼上按钮 3楼上下按钮 4楼下按钮" ,
"111101" : "1楼上按钮 2楼上按钮 3楼上下按钮 4楼下按钮" ,
"111110" : "1楼无按钮 2楼上下按钮 3楼上下按钮 4楼下按钮" ,
"111111" : "1楼上按钮 2楼上下按钮 3楼上下按钮 4楼下按钮"
}
button_list = []
for number in range(64):
    #print(bin(number)[2:])
    formatted_binary = f"{number:b}"
    #print(formatted_binary.zfill(6))
    str_6 = formatted_binary.zfill(6)
    anniu_desc = []
    if str_6[5] == '0':
        anniu_desc.append('1楼无按钮')
    else:
        anniu_desc.append('1楼上按钮')

    if str_6[3:5] == '00':
        anniu_desc.append('2楼无按钮')
    elif str_6[3:5] == '01':
        anniu_desc.append('2楼下按钮')
    elif str_6[3:5] == '10':
        anniu_desc.append('2楼上按钮')
    else:
        anniu_desc.append('2楼上下按钮')

    if str_6[1:3] == '00':
        anniu_desc.append('3楼无按钮')
    elif str_6[1:3] == '01':
        anniu_desc.append('3楼下按钮')
    elif str_6[1:3] == '10':
        anniu_desc.append('3楼上按钮')
    else:
        anniu_desc.append('3楼上下按钮')

    if str_6[0] == '0':
        anniu_desc.append('4楼无按钮')
    else:
        anniu_desc.append('4楼下按钮')

    #print('"'+str_6+'"', ':',  '"' + ' '.join(anniu_desc) + '\"', ',')
    button_list.append(anniu_desc)
#print(anniu_dict['001001'])
#单电梯状态，3*楼层-2,
lift_staus = ['1楼', '2楼', '3楼', '4楼', '1楼上', '2楼上', '3楼上', '2楼下', '3楼下', '4楼下']

all_status = []
for lift1 in lift_staus:
    for lift2 in lift_staus:
        for button in button_list:
            s = button.copy()
            s.append('1电梯' + lift1)
            s.append('2电梯' + lift2)
            all_status.append(s)
#考虑用6位数字来表示一个状态，4个楼层的按钮，0~4（1楼，2楼，3楼，4楼），2个电梯的位置0~9（电梯1，电梯2）
#print(anniu_dict.values())
#print(button_list)
print(len(all_status))

for state in all_status:
    print(state)